package cc.bugcat.bcdt.ops.openapi.link;

/**
 * 
 * 
 * 
 * 新增链接：直接修改数据库‘zentao.bc_link’表；
 * 
 * 
 *  id：数字格式为 AABCCDDDEE
 *  
 *      AA，区分所属页面；11 工作台；12 开发工具；13 开发环境；xx 环境；
 *      
 *      B，链接在页面上第几列；每个页面有3列超链接；1 第一列；2 第二列；3 第三列；
 *      
 *      CC，链接在列中属于第几段落；每一列可以分为多个段落；
 *      
 *      DDD，具体链接编号；
 *      
 *      EE，可选项，配合 type=link-more 使用，标记此数据为‘AABCCDDD’的下级子项；
 *  
 *  
 *  type：当前数据分类：
 *      
 *      label，标记当前数据是一个段落的标题，如果‘label’字段为空，页面上不显示段落名称；
 *          
 *      label-cpt，效果同label，并且会将‘extra’内容渲染成vue组件，进行额外内容显示；
 *      
 *          每一个段落，必须存在一条‘label’数据，作为段落数据的父类，可以有多个其他类型数据子类；
 *      
 *      link，是超链接；
 *      
 *      link-more，效果同link，会在名称后面显示更多‘按钮’，鼠标点击之后展示下级子项链接信息；
 *      
 *      new-line，空行，用来分隔排版；
 *      
 *      text，一段描述；
 *  
 *  
 *  label：页面上显示内容；
 *      
 *      使用 {{ }} 包裹的文本，会被超链接标签替换；
 *      
 *          例如，‘商户系统 {{后台}}’，生成的Html为：‘商户系统 <a>后台</a>’，超链接会由点击‘后台’触发；
 *      
 *      空字符串 ‘’，当type=label时，不显示段落的名称。
 *          
 *
 *  title：鼠标移入超链接上，显示的title内容，可以为空，默认为label字段值；
 * 
 *  
 *  linkUrl：超链接url；
 *  
 *      多个链接，使用 | 隔开，与label中的 {{ }} 位置、数量一一对应。
 *      
 *      # 开头，在办公平台页面框架内打开链接；
 *      
 *      $ 开头，新开窗口打开链接；
 *   
 *      @ 开头，执行页面上对应的JS函数；
 *  
 *  
 *  winTitle，标签页、新开窗口的标题内容；
 *  
 *  
 *  className，自定义超链接样式名；
 *  
 *  
 *  acs，当前链接需要的权限编号；
 *  
 *  
 *  desc，超链接的更多描述、提示；
 *  
 *  
 *  extra，更多定制化的配置，为Json字符串；
 *  
 *  
 *  pageId，所属页面代码：
 *  
 *      desktop 工作台；devtools开发工具；devenv开发环境；--- 下级子项数据；
 *  
 *  
 *  rowId，有相同rowId的数据，会在同一行、两端对齐显示；
 *  
 *  
 *  active，当前数据是否有效；
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * */